from datetime import datetime  # Импорт класса для работы со временем
from math import sqrt  # Импорт функции для вычисления квадратного корня

def main(**kwargs):
    """
    Вычисляет евклидову норму для векторов, переданных в параметрах.
    Аргументы:
        **kwargs (dict): Словарь с произвольными именованными параметрами,
        где значения - списки из двух чисел [x, y]
    Возращаемое значение:
        Для каждого переданного вектора вычисляется sqrt(x² + y²)
    """
    for key in kwargs.items():  # Итерация по парам
        result = sqrt(key[1][0] ** 2 + key[1][1] ** 2)  # Вычисление евклидовой нормы вектора
        print(result)  # Вывод результата вычисления

if __name__ == '__main__':
    start_time = datetime.now()  # Запись времени начала выполнения программы

    main(
        one=[10, 3],  # Примеры векторов для вычисления
        two=[5, 4],
        three=[15, 13],
        four=[93, 53],
        five=[133, 15]
    )

    time_costs = datetime.now() - start_time  # Расчет времени выполнения
    print(f"Время выполнения программы - {time_costs}")  # Вывод времени выполнения